# YOLO11m Enhanced - 强化版教师模型
# 设计原则：使用同态结构（homogeneous distillation）便于蒸馏
# 增强：更深的特征提取 + 多位置注意力增强

nc: 6
scales:
  m: [0.50, 1.00, 512]

backbone:
  # === 标准Backbone ===
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  # === 增强：C2PSA + ECA (更深n=3) ===
  - [-1, 3, C2PSA_ECA, [1024]]          # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]           # 12
  # === 增强：Neck使用更深的C3k2 ===
  - [-1, 3, C3k2, [512, False]]         # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]           # 15
  - [-1, 3, C3k2, [256, False]]         # 16

  - [-1, 1, Conv, [256, 3, 2]]          # 17
  - [[-1, 13], 1, Concat, [1]]          # 18
  - [-1, 3, C3k2, [512, False]]         # 19

  - [-1, 1, Conv, [512, 3, 2]]          # 20
  - [[-1, 10], 1, Concat, [1]]          # 21
  - [-1, 2, C3k2, [1024, True]]         # 22

  - [[16, 19, 22], 1, Segment, [nc, 32, 256]]  # 23
